eisup_2019_docmng_integration/src/AccumulationRegisters/НДСЗаписиКнигиПродаж/НДСЗаписиКнигиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НДСЗаписиКнигиПродаж</name>
  <comment>НДС. Записи книги продаж</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерДокументаОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.абс_Продавец</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетФактура</name>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</types>
      <types>DocumentRef.ОплатаОтПокупателяПлатежнойКартой</types>
      <types>DocumentRef.КорректировочныйСчетФактураПолученный</types>
      <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.АккредитивПолученный</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АккредитивПереданный</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ИнкассовоеПоручениеПолученное</types>
      <types>DocumentRef.РеализацияОтгруженныхТоваров</types>
      <types>DocumentRef.НачислениеНДСпоСМРхозспособом</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.КорректировочныйСчетФактураВыданный</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>DocumentRef.ИнкассовоеПоручениеПереданное</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦенности</name>
    <type>
      <types>EnumRef.ВидыЦенностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОплаты</name>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.АккредитивПолученный</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ИнкассовоеПоручениеПереданное</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.СобытияПоНДСПродажи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <comment>Договор контрагента (для счетов-фактур на аванс, и нал. агента по п. 5 ст. 161 НК)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаписьДополнительногоЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорректируемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СторнирующаяЗаписьДопЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсправленныйСчетФактура</name>
    <type>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.КорректировкаРеализации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыЦенностей/ВидыЦенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЦенностей</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>АвансыВыданные</name>
    <comment>для учета НДС, предъявленного по выданному авансу</comment>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
    <comment>для учета НДС, исчисленного с полученных авансов, кроме НДС с авансов под будущие поставки с 0%</comment>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные0</name>
    <comment>для учета НДС с авансов, полученных под будущие поставки с применением ставки 0%</comment>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПотребление</name>
    <comment>Ценности (товары, работы или услуги, переданные для собственного потребления внутри организации)</comment>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
    <comment>для учета НДС, по возвращаемым от покупателя (поставщику) ценностям</comment>
  </enumValues>
  <enumValues>
    <name>ИмуществоСУчетомНДС</name>
    <comment>Имущество, в балансовую стоимость которого входит НДС, уплаченный ранее поставщикам данного имущества</comment>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
    <comment>для отражения НДС по командировочным расходам</comment>
  </enumValues>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентАренда</name>
    <comment>для учета сумм НДС, удержанных при аренде имущества у государственных и муниципальных органов</comment>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентИностранцы</name>
    <comment>для учета сумм НДС, удержанных с иностранцев, не состоящих на налоговом учете в РФ</comment>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентКомитент</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентРеализацияИмущества</name>
    <comment>для учета сумм НДС, удержанных при приобретении государственного и муниципального имущества</comment>
  </enumValues>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
    <comment>для учета НДС по приобретаемому оборудованию требующему монтажа для ввода в эксплуатацию</comment>
  </enumValues>
  <enumValues>
    <name>ОбъектыНезавершенногоСтроительства</name>
    <comment>для учета НДС по приобретаемым (реализуемым) объектам незавершенного строительства</comment>
  </enumValues>
  <enumValues>
    <name>ОС</name>
  </enumValues>
  <enumValues>
    <name>ПосредническиеУслуги</name>
    <comment>Посреднические услуги оказываемые в интересах другого лица на основе договоров поручения, комиссии либо агентских договоров</comment>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
    <comment>для учета НДС по представительским расходам</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРаботыИУслуги</name>
  </enumValues>
  <enumValues>
    <name>СМРПодрядные</name>
    <comment>для учета НДС, предъявленных подрядчиками при выполнении строительства ОС</comment>
  </enumValues>
  <enumValues>
    <name>СМРСобственнымиСилами</name>
    <comment>для учета НДС, приходящегося на СМР, выполненные самой организацией (хозспособ)</comment>
  </enumValues>
  <enumValues>
    <name>СуммыСвязанныеСРасчетамиПоОплате</name>
    <comment>Суммы, связанные с расчетами по оплате (ст. 162 НК РФ)</comment>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежи</name>
    <comment>для учета НДС, уплаченного налогоплательщиком при ввозе на территорию России товаров</comment>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежиОС</name>
    <comment>Для учета НДС, уплаченного налогоплательщиком при ввозе на территорию России ОС и оборудования (использование с 01.01.2006)</comment>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ТоварыУслугиКомитентов</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученных</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/AccumulationRegisters/НДСЗаписиКнигиПродаж/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

Процедура ДобавитьДвижение(ЗаполнитьДатуСобытия = истина) Экспорт
	
	//мТаблицаДвижений.ЗаполнитьЗначения( мПериод, "Период");
	мТаблицаДвижений.ЗаполнитьЗначения( Истина,  "Активность");
	
	Если мТаблицаДвижений.Колонки.Найти("ДатаСобытия") = Неопределено Тогда
		мТаблицаДвижений.Колонки.Добавить("ДатаСобытия");
		ЗаполнитьДатуСобытия = истина;
	КонецЕсли; 
	
	Если ЗаполнитьДатуСобытия Тогда
		мТаблицаДвижений.ЗаполнитьЗначения( мПериод, "ДатаСобытия");
	КонецЕсли; 
	
	ttk_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект);
	
КонецПроцедуры // ДобавитьДвижение()

Процедура ПередЗаписью(Отказ, Замещение)
	
	//АБС ВСТАВКА №44969 НАЧАЛО «2 июля 2014 г.», Пополитов
	Для Каждого Движение Из ЭтотОбъект Цикл
// +++ввв 01.03.2016 г.
		Если Движение.КодВидаОперации="" И ЗначениеЗаполнено(Движение.Регистратор) Тогда
			Если ТипЗнч(Движение.Регистратор.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				Движение.КодВидаОперации="01";
			   	йЮЛ=Константы.ttk_АгрегатноеЮридическоеЛицо.Получить();
				Если ЗначениеЗаполнено(йЮЛ) Тогда
					Если йЮЛ=Движение.Регистратор.Контрагент Тогда
						//Движение.КодВидаОперации="26";
					КонецЕсли;
				КонецЕсли;
				йФЛ=Константы.ttk_АгрегатноеФизическоеЛицо.Получить();
				Если ЗначениеЗаполнено(йФЛ) Тогда
					Если йФЛ=Движение.Регистратор.Контрагент Тогда
						Движение.КодВидаОперации="26";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
// ---ввв 01.03.2016 г.
		Если Движение.ВидЦенности = Перечисления.ВидыЦенностей.АвансыПолученные Тогда
			Движение.абс_СчетУчета = kwr_ОбщиеСерверКлиентПовтИсп.ПланыСчетовХозрасчетныйНайтиПоКоду("76.АВ");	
		ИначеЕсли Движение.ВидЦенности = Перечисления.ВидыЦенностей.АвансыВыданные Тогда
			Движение.абс_СчетУчета = kwr_ОбщиеСерверКлиентПовтИсп.ПланыСчетовХозрасчетныйНайтиПоКоду("76.ВА");	
		КонецЕсли;	 				
	КонецЦикла;	
	//\\АБС ВСТАВКА №44969 КОНЕЦ 
	
КонецПроцедуры
